"""Тимофей обычно спит ночью X часов и устраивает cебе днем тихий час на Y минут.
Определите, сколько всего минут Тимофей спит в сутки."""

X = int(input())
Y = int(input())
print(X*60 + Y)
