"""Напишите простой калькулятор, который считывает с пользовательского ввода три строки: первое число,
 второе число и операцию, после чего применяет операцию к введённым числам
 ("первое число" "операция" "второе число") и выводит результат на экран.

Поддерживаемые операции: +, -, /, *, mod, pow, div, где
mod — это взятие остатка от деления,
pow — возведение в степень,
div — целочисленное деление.

Если выполняется деление и второе число равно 0, необходимо выводить строку "Деление на 0!"."""

a = float(input())
b = float(input())
operator = input()

if operator == '+':
    print(a+b)
if operator == '-':
    print(a-b)
if operator == '/':
    if b == 0:
        print('Деление на 0!')
    else:
        print(a/b)
if operator == '*':
    print(a*b)
if operator == 'mod':
    if b == 0:
        print('Деление на 0!')
    else:
        print(a % b)
if operator == 'pow':
    print(a**b)
if operator == 'div':
    if b == 0:
        print('Деление на 0!')
    else:
        print(a//b)



